In [ ]:
# MergingJoiningConcatation

In [1]:
import numpy as np
import pandas as pd

In [9]:
emp = pd.DataFrame({
    'employee id':[1,2,3,4,5],
    'name' :['john','ana','smith','jack','william'],
    'location':['AP','TS','HP',"J & k",'Goa']
})
jobs =pd.DataFrame({
    'employee id':[1,2,3,6,7],
    'Salary':[60000,79900,73927,739278,4897],
    'tax':[20,10,3,6,9]
})

In [6]:
emp

   emplyee id     name location
0           1     john       AP
1           2      ana       TS
2           3    smith       HP
3           4     jack    J & k
4           5  william      Goa

In [7]:
jobs

   employee id  Salary  tax
0            1   60000   20
1            2   79900   10
2            3   73927    3
3            6  739278    6
4            7    4897    9

In [10]:
pd.merge(emp,jobs)
# alteast on column should be match

   employee id   name location  Salary  tax
0            1   john       AP   60000   20
1            2    ana       TS   79900   10
2            3  smith       HP   73927    3

In [11]:
pd.merge(emp,jobs,on ='employee id')

   employee id   name location  Salary  tax
0            1   john       AP   60000   20
1            2    ana       TS   79900   10
2            3  smith       HP   73927    3

In [12]:
pd.merge(emp,jobs,on ='employee id',how='inner')

   employee id   name location  Salary  tax
0            1   john       AP   60000   20
1            2    ana       TS   79900   10
2            3  smith       HP   73927    3

In [13]:
pd.merge(emp,jobs,on ='employee id',how='outer')

   employee id     name location    Salary   tax
0            1     john       AP   60000.0  20.0
1            2      ana       TS   79900.0  10.0
2            3    smith       HP   73927.0   3.0
3            4     jack    J & k       NaN   NaN
4            5  william      Goa       NaN   NaN
5            6      NaN      NaN  739278.0   6.0
6            7      NaN      NaN    4897.0   9.0

In [14]:
pd.merge(emp,jobs,on ='employee id',how='left')

   employee id     name location   Salary   tax
0            1     john       AP  60000.0  20.0
1            2      ana       TS  79900.0  10.0
2            3    smith       HP  73927.0   3.0
3            4     jack    J & k      NaN   NaN
4            5  william      Goa      NaN   NaN

In [15]:
pd.merge(emp,jobs,on ='employee id',how='right')

   employee id   name location  Salary  tax
0            1   john       AP   60000   20
1            2    ana       TS   79900   10
2            3  smith       HP   73927    3
3            6    NaN      NaN  739278    6
4            7    NaN      NaN    4897    9

In [ ]:
# concatation

In [16]:
dt1=pd.DataFrame({
    'A':['A0','A1','A0'],
    'B':['B0','B1','B2'],
    'C':['C0','C1','C2']
})
dt2 =pd.DataFrame({
    'A':['A3','A4','A5'],
    'B':['B3','B4','B5'],
    'C':['C3','C4','C5']
    
})

In [17]:
dt1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A0  B2  C2

In [18]:
dt2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [19]:
pd.concat([dt1,dt2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A0  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [20]:
pd.concat([dt1,dt2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A0  B2  C2  A5  B5  C5

In [ ]:
# joining 2 data frames

In [31]:
df1=pd.DataFrame({
    'name':['Joy boy','Ryuma','Oggy'],
    
},index=[1,2,3])
df2=pd.DataFrame({
    'level':['A','A','A+'],
},index=[1,29,0])

In [22]:
df1

      name  index
0  Joy boy      1
1    Ryuma      2
2     Oggy      3

In [23]:
df2

  level  index
0     A      1
1     A      2
2    A+      3

In [33]:
df1.join(df2,how='outer')

       name level
0       NaN    A+
1   Joy boy     A
2     Ryuma   NaN
3      Oggy   NaN
29      NaN     A